Hemantmehta14/Elevator-Control-System-using-STM32F446RE/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define pb1_Pin GPIO_PIN_0
#define pb1_GPIO_Port GPIOC
#define pb2_Pin GPIO_PIN_1
#define pb2_GPIO_Port GPIOC
#define pb3_Pin GPIO_PIN_2
#define pb3_GPIO_Port GPIOC
#define pb4_Pin GPIO_PIN_3
#define pb4_GPIO_Port GPIOC
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA
#define floor1_Pin GPIO_PIN_4
#define floor1_GPIO_Port GPIOA
#define floor2_Pin GPIO_PIN_5
#define floor2_GPIO_Port GPIOA
#define floor3_Pin GPIO_PIN_6
#define floor3_GPIO_Port GPIOA
#define floor4_Pin GPIO_PIN_7
#define floor4_GPIO_Port GPIOA
#define idle_Pin GPIO_PIN_4
#define idle_GPIO_Port GPIOC
#define door_open_Pin GPIO_PIN_5
#define door_open_GPIO_Port GPIOC
#define moving_s_Pin GPIO_PIN_0
#define moving_s_GPIO_Port GPIOB
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
